class SlopeScoresModel {
  final Map<String, int> slopeScores;

  SlopeScoresModel(this.slopeScores);
}

Map<String, Map<String, int>> slopeScoresMap = {
  '0': konjiam,
  '1': muju,
  '2': vivaldi,
  '3': alpensia,
  '4': eden,
  '5': gangchon,
  '6': oak,
  '7': o2,
  '8': yongpyong,
  '9': welli,
  '10': jisan,
  '11': high1,
  '12': phoenix,
  // ... 필요한 만큼 이름과 슬로프 점수를 추가로 매핑합니다.
};

Map<String, int> konjiam = {
  'CNP1': 10,
  'CNP2': 10,
  '씽큐B': 10,
  '씽큐1': 10,
  '씽큐2': 10,
  '그램1': 10,
  '그램2': 10,
  '휘센': 10,
  '와이낫': 10,
};
Map<String, int> muju = {
  '카누': 10,
  '라이너': 10,
  '무주E': 10,
  '크루저': 10,
  '요트': 10,
  '보트': 10,
  '스쿨B': 10,
  '쌍쌍': 10,
  '곤도라': 10,
  '에코': 10,
  '코러스': 10,
  '하모니': 10,
  '멜로디': 10,
};
Map<String, int> vivaldi = {
  '발라드': 10,
  '재즈': 20,
  '레게': 30,
  '클래식': 40,
  '테크노2': 50,
  '락': 20,
  '펑키': 20,
  '힙합': 20,
  '테크노1': 20,
  '블루스': 20,
};
Map<String, int> alpensia = {
  '리프트1': 10,
  '리프트2': 10,
  '리프트3': 10,
};
Map<String, int> eden = {
  '아담': 10,
  '밸리': 10,
  '에덴': 10,
};
Map<String, int> gangchon = {
  'E': 10,
  'D': 10,
  'C': 10,
  'A1': 10,
  'B': 10,
  'A': 10,
};
Map<String, int> oak = {
  '버드': 10,
  '마운틴': 10,
  '플라워': 10,
};
Map<String, int> o2 = {
  '토마토': 10,
  '키위': 10,
  '곤돌라': 10,
  '오렌지': 10,
  '체리': 10,
  '애플': 10,
};
Map<String, int> yongpyong = {
  '레드': 10,
  '뉴레드': 10,
  '브릿지': 10,
  '뉴골드': 10,
  '골드': 10,
  '핑크': 10,
  '옐로우': 10,
  '뉴옐로': 10,
  '그린': 10,
  '메가G': 10,
  '실버': 10,
  '블루': 10,
  '렌보': 10,
};
Map<String, int> welli = {
  '알파': 10,
  '뉴알파': 10,
  '뉴브': 10,
  '델타': 10,
  '곤돌라': 10,
  '패밀리': 10,
  '챌린지': 10,
  '에코': 10,
  '파이프': 10,
};
Map<String, int> jisan = {
  '실버': 10,
  '블루': 10,
  '뉴오렌': 10,
  '오렌지': 10,
  '레몬': 10,
};
Map<String, int> high1 = {
  'M허브': 10,
  '아테나': 10,
  'H탑': 10,
  '제우스': 10,
  '주피터': 10,
  '아폴로': 10,
  '헤라': 10,
  '빅토리': 10,
};
Map<String, int> phoenix = {
  '스패': 10,
  '챔피온': 20,
  '파노': 30,
  '환타지': 40,
  '디지': 50,
  '호크1': 20,
  '호크2': 20,
  '펭귄': 20,
  '밸리': 20,
  '마스터': 20,
  '모글': 20,
  '키위': 20,
  '도도': 20,
  '슬스': 20,
  '도브': 20,
  '듀크': 20,
  '파라': 20,
  '파크': 20,
  '파이프': 20,
};

















